[
    {
      "title": "p-SymPy",
      "description": "Have you ever wanted to contribute to open source software? Join my project and gain the opportunity to do just that! My goal is to enhance the performance of the assumptions module in SymPy, a widely-used Python-based computer algebra system (think WolframAlpha, but in Python)."
    },
    {
      "title": "p-laylist",
      "description": "Have you ever been frustrated with Spotify recommending the same songs repeatedly, even when your interests change? Our project tackles these issues by developing an AI-powered web app for collaborative music recommendations."
    },
    {
      "title": "p-UBet",
      "description": "This project aims to develop a social goal-betting web application, inspired by elements of fantasy sports betting, to help users achieve their personal goals through accountability, community, and stakes. The app will allow users to set personal goals, place monetary bets on their success, and invite friends or peers to bet on their challenges for monetary and social reinforcement. The app's unique angle blends gamification, social collaboration, and psychology to encourage habit formation and sustained motivation."
    },
    {
      "title": "p-ackUp",
      "description": "In our project, we will be developing a full-stack, chat-based travel planner that utilizes the Google Gemini LLM to help users create unique trip itineraries by not only including classic tourist attractions but also featuring iconic filming locations and memorable places depicted in our favorite movies/shows. Our system personalizes travel itineraries based on user preferences and selected destinations, creating a plan that includes famous sightseeing spots, movie scene locations, local specialties, and the best places to try them, while at the same time optimizing travel schedules considering opening hours and distance between locations. The main goal of our project is to learn how to prompt and integrate LLMs within a full-stack application!"
    },
    {
      "title": "p-PoseLock",
      "description": "This project focuses on developing an authentication system using pose estimation and gait feature analysis. Unlike traditional biometrics, such as fingerprint scanning or facial recognition, this system identifies individuals based on their unique walking styles, which are detected using a camera aimed at the side of the individual. This provides a seamless and non-intrusive authentication method, unlike more invasive methods like fingerprint scanning."
    },
    {
      "title": "p-Recommendation",
      "description": "Recommendation and matching algorithms are pivotal in enhancing user experiences across various platforms, including social media, dating apps, video games, and professional networking sites. Our project focuses on developing a tailored recommendation algorithm to facilitate meaningful group connections in real-world settings. This algorithm will be implemented in the in-development mobile app Yaaro, which is already live with real users and active data. Yaaro is designed to make meeting people locally and forming in-person connections more accessible. By leveraging user data and behavioral patterns, the app aims to recommend nearby individuals with shared interests."
    },
    {
       "title": "p-ai",
       "description": "The goal of this project is to create a new website for the P-ai club. The old website is quite outdated and isn't organized well. In this project we would be designing, programming and deploying a new website. The new webpage for P-ai will be easier to navigate, more visually appealing, and function as a portfolio for everyone's projects. Therefore, the club will be presented as more professional and attractive. Also, in such a way, anyone who participated in a p-ai project can showcase their work in applications by using a link from the website's portfolio page."
    },
    {
      "title": "p-MarketForecast",
      "description": "p-MarketForecast aims to predict large swings in stock market trends by identifying significant events and analyzing their impact on financial markets. The project aims to use both news data (scraped from the web) along with financial data (volume, indicators, quarterly reports, etc.). The project addresses the challenges of anticipating market shifts. Using historical market data and news sentiment analysis, we aim to integrate machine learning models to identify patterns and forecast major market movements."
    },
    {
      "title": "p-ickup",
      "description": "No one wants to spend $100 on a single Uber ride to LAX, especially after already paying hundreds for a ticket home. While the Claremont Colleges sometimes offer subsidized shuttle services, these are not always available at convenient dates or times for everyone. Our P-ickup website aims to address this issue by providing students with a platform to fill out a matching form (flight information, dates, airport preferences, etc.). The platform will feature a messaging system, rideshare cost predictions, and a machine learning model that improves its matching accuracy over time based on user ratings and feedback."
    },
    {
      "title": "p-MarketForecast",
      "description": "p-MarketForecast aims to predict large swings in stock market trends by identifying significant events and analyzing their impact on financial markets. The project aims to use both news data (scraped from the web) along with financial data (volume, indicators, quarterly reports, etc.). The project addresses the challenges of anticipating market shifts. Using historical market data and news sentiment analysis, we aim to integrate machine learning models to identify patterns and forecast major market movements."
    },
    {
      "title": "p-Invest",
      "description": "This project aims to develop a Google Chrome extension for Robinhood to enhance user understanding of investing. The extension will provide advanced insights on user trades, such as detecting overexposure to specific market sectors, and enable filtering and trend visualization. It will also create a unique user investing persona based on scraped data and leverage the OpenAI API to offer personalized, adaptive investment recommendations and guidance. The goal is to help users learn from their investing patterns, improve decision-making, and develop independent investing habits."
    }
  ]
  